In [1]:
import pandas as pd
import mysql.connector as sql

con = sql.connect(host='localhost', user='root', password='mysql@dev', database='imdb')

print(con)

<mysql.connector.connection.MySQLConnection object at 0x000002765897E788>

In [2]:
pd.read_sql_query("SHOW TABLES", con)

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

In [3]:
def query(q):
    return pd.read_sql_query(q, con)

### actors

In [4]:
query('SELECT * FROM actors LIMIT 5;')

   id first_name           last_name gender
0   2    Michael  'babeepower' Viera      M
1   3       Eloy         'Chincheta'      M
2   4   Dieguito         'El Cigala'      M
3   5    Antonio    'El de Chipiona'      M
4   6       José        'El Francés'      M

### directors

In [5]:
query('SELECT * FROM directors LIMIT 5;')

   id first_name    last_name
0   1       Todd            1
1   2        Les  12 Poissons
2   3    Lejaren     a'Hiller
3   4       Nian            A
4   5   Khairiya    A-Mansour

### directors_genres

In [11]:
query('SELECT * FROM directors_genres LIMIT 5;')

   director_id        genre  prob
0            2        Short   1.0
1            3        Drama   1.0
2            5  Documentary   1.0
3            6        Drama   1.0
4            6        Short   1.0

### movies

In [12]:
query('SELECT * FROM movies LIMIT 5;')

   id                                 name  year  rankscore
0   0                                  #28  2002        NaN
1   1  #7 Train: An Immigrant Journey, The  2000        NaN
2   2                                    $  1971        6.4
3   3                        $1,000 Reward  1913        NaN
4   4                        $1,000 Reward  1915        NaN

### movies_directors

In [13]:
query('SELECT * FROM movies_directors LIMIT 5;')

   director_id  movie_id
0            1    378879
1            2    281325
2            3     30621
3            3    304743
4            4     60570

### movies_genres

In [14]:
query('SELECT * FROM movies_genres LIMIT 5;')

   movie_id        genre
0         1  Documentary
1         1        Short
2         2       Comedy
3         2        Crime
4         5      Western

### roles

In [15]:
query('SELECT * FROM roles LIMIT 5;')

   actor_id  movie_id              role
0         2    280088            Stevie
1         2    396232  Various/lyricist
2         3    376687          Gitano 1
3         4    336265         El Cigala
4         5    135644           Himself